{
    "FormatVersion": 2,
    "Namespace": "",
    "Children": [
        {
            "Source": {
                "Text": "1× Assembler · 2.5/min of 12.5 needed"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "AB46CACF4C402D0A0C2BBD8FB7B2500A"
        },
        {
            "Source": {
                "Text": "1× Manufacturer · 2.5/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3AE89A3A41716D0C1158828D998F52A4"
        },
        {
            "Source": {
                "Text": "2,000 needed  ·  2,000 banked  ·  deliver now"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "650C25414036AC525E39C79183343F3B"
        },
        {
            "Source": {
                "Text": "2× Assembler · 25/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "FE02FE6043275C5F429266A6F006A805"
        },
        {
            "Source": {
                "Text": "2× Manufacturer · 5.0/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "9614FDD644BF8B9EE29DE8A6D6732B2C"
        },
        {
            "Source": {
                "Text": "3 parts required  ·  1 ready to deliver  ·  1 blocked  ·  earliest completion ~72 min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "7F101E664166DBC1D99692B19B5313F2"
        },
        {
            "Source": {
                "Text": "480 needed  ·  120 banked  ·  360 to produce  ·  ~72 min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "E8ACA03D49EB7261E197659531E32B6F"
        },
        {
            "Source": {
                "Text": "99 needed  ·  7 banked  ·  92 to produce  ·  blocked"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3BE554254D343A7BBCA2B7B5A00AF90C"
        },
        {
            "Source": {
                "Text": "Adaptive Control Unit"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "08EBECCB41804E37453A4AAA1FD5F3E3"
        },
        {
            "Source": {
                "Text": "Automated Wiring"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "9EF74FE34AE569C38CA64E9D82C844A8"
        },
        {
            "Source": {
                "Text": "CRITICAL PATH"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "043B5BBC45C8B0568744889832C5FD6B"
        },
        {
            "Source": {
                "Text": "Modular Engine"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "E3B96B684DA94C6196E53B9E5EF65A3E"
        },
        {
            "Source": {
                "Text": "Space Elevator: Main Body"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "2523207949D893471F1C63BF2314EACE"
        },
        {
            "Source": {
                "Text": "Stator"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "F616D3404E39FA0AE068C5AD74FA8243"
        },
        {
            "Source": {
                "Text": "Versatile Framework"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "73F3C0684140FD63EC7EBF898F7BE8AD"
        },
        {
            "Source": {
                "Text": "no producer configured"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "B4DE02E8428694AE136D48822BF08AE1"
        },
        {
            "Source": {
                "Text": "×"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "1A0751FB44AC4366F8DF2BBCAF1BFF20"
        },
        {
            "Source": {
                "Text": "× BLOCKED — Adaptive Control Unit is stalled. Build a Stator line: it gates Automated Wiring → Adaptive Control Unit → Main Body."
            },
            "Translation": {
                "Text": ""
            },
            "Key": "C00C970340D208F8A377D2B6647BE15D"
        },
        {
            "Source": {
                "Text": "■"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "916D7FF44FD10ADF39543CA075B7F49A"
        },
        {
            "Source": {
                "Text": "▲"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "B93CDE3745A0108F118915A3EB4B3B18"
        },
        {
            "Source": {
                "Text": "▲"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3D920FAE42B1D930C642E6933107B5CB"
        },
        {
            "Source": {
                "Text": "●"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "29308E89411226D839FFDD9CFE508DF0"
        }
    ],
    "Subnamespaces": [
        {
            "Namespace": "CriticalPath",
            "Children": [
                {
                    "Source": {
                        "Text": "  ·  nearest endpoint {0} m away"
                    },
                    "Translation": {
                        "Text": "  ·  ปลายทางใกล้สุดห่าง {0} ม."
                    },
                    "Key": "BalanceDistanceFmt"
                },
                {
                    "Source": {
                        "Text": "ALL AUGMENTS"
                    },
                    "Translation": {
                        "Text": "ตัวเสริมทั้งหมด"
                    },
                    "Key": "BalanceAugmentAll"
                },
                {
                    "Source": {
                        "Text": "ALL LINES"
                    },
                    "Translation": {
                        "Text": "สายการผลิตทั้งหมด"
                    },
                    "Key": "BalanceProblemAll"
                },
                {
                    "Source": {
                        "Text": "AT FULL SPEED  needs {0}  ·  ingredients allow {1}  ·  would deliver {2}"
                    },
                    "Translation": {
                        "Text": "เต็มกำลัง  ต้องการ {0}  ·  วัตถุดิบรองรับ {1}  ·  จะส่งได้ {2}"
                    },
                    "Key": "BalanceDesignFmt"
                },
                {
                    "Source": {
                        "Text": "AWESOME Shop"
                    },
                    "Translation": {
                        "Text": "AWESOME Shop"
                    },
                    "Key": "SrcShop"
                },
                {
                    "Source": {
                        "Text": "Across the whole factory only {0}/min is available against {1}/min needed ({2}%) - this may be a different line"
                    },
                    "Translation": {
                        "Text": "ทั้งโรงงานมีเพียง {0}/นาที เทียบกับที่ต้องการ {1}/นาที ({2}%) - อาจเป็นคนละสายการผลิต"
                    },
                    "Key": "LimiterNetFmt"
                },
                {
                    "Source": {
                        "Text": "Already produced"
                    },
                    "Translation": {
                        "Text": "ผลิตแล้ว"
                    },
                    "Key": "PlanGraft"
                },
                {
                    "Source": {
                        "Text": "Already produced - {0}"
                    },
                    "Translation": {
                        "Text": "ผลิตแล้ว - {0}"
                    },
                    "Key": "PlanGraftFmt"
                },
                {
                    "Source": {
                        "Text": "Arriving ingredients only support {0} of the {1} these machines could make"
                    },
                    "Translation": {
                        "Text": "วัตถุดิบที่เข้ามารองรับได้เพียง {0} จาก {1} ที่เครื่องจักรเหล่านี้ผลิตได้"
                    },
                    "Key": "LimiterInputConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Asking the host for a report"
                    },
                    "Translation": {
                        "Text": "กำลังขอรายงานจากโฮสต์"
                    },
                    "Key": "AskingHostHeadline"
                },
                {
                    "Source": {
                        "Text": "Assumed recipe: {0}"
                    },
                    "Translation": {
                        "Text": "สูตรที่สันนิษฐาน: {0}"
                    },
                    "Key": "PlanTipFmt"
                },
                {
                    "Source": {
                        "Text": "A–Z"
                    },
                    "Translation": {
                        "Text": "A–Z"
                    },
                    "Key": "BalanceSortAlphabetical"
                },
                {
                    "Source": {
                        "Text": "BALANCE"
                    },
                    "Translation": {
                        "Text": "สมดุล"
                    },
                    "Key": "TabBalance"
                },
                {
                    "Source": {
                        "Text": "BELT JAMMED · {0} machine(s) blocked by {1} on the feeding belt - remove it; this is not a supply shortage"
                    },
                    "Translation": {
                        "Text": "สายพานอุดตัน · เครื่องจักร {0} เครื่องถูกขวางโดย {1} บนสายพานป้อน - นำออก นี่ไม่ใช่ปัญหาวัตถุดิบขาดแคลน"
                    },
                    "Key": "BalanceJammedFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - the plan ({0} step(s)):"
                    },
                    "Translation": {
                        "Text": "ติดขัด - แผนงาน ({0} ขั้นตอน):"
                    },
                    "Key": "VerdictPlanBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - {0} step(s) to deliver {1}"
                    },
                    "Translation": {
                        "Text": "ติดขัด - อีก {0} ขั้นตอนเพื่อส่งมอบ {1}"
                    },
                    "Key": "VerdictPlanBlockedDeliverFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - {0}: {1}."
                    },
                    "Translation": {
                        "Text": "ติดขัด - {0}: {1}."
                    },
                    "Key": "VerdictBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "BUFFER  {0} {1} reachable"
                    },
                    "Translation": {
                        "Text": "บัฟเฟอร์  เข้าถึงได้ {0} {1}"
                    },
                    "Key": "BufferAmountFmt"
                },
                {
                    "Source": {
                        "Text": "BUFFER  {0} {1} reachable  ·  about {2} min at the current shortfall"
                    },
                    "Translation": {
                        "Text": "บัฟเฟอร์  เข้าถึงได้ {0} {1}  ·  ประมาณ {2} นาทีที่อัตราขาดปัจจุบัน"
                    },
                    "Key": "BufferRunwayFmt"
                },
                {
                    "Source": {
                        "Text": "BUILT CAPACITY"
                    },
                    "Translation": {
                        "Text": "กำลังที่สร้าง"
                    },
                    "Key": "BalanceInstalled"
                },
                {
                    "Source": {
                        "Text": "Belt bottleneck: {0} → {1} carries {2} of {3}"
                    },
                    "Translation": {
                        "Text": "คอขวดสายพาน: {0} → {1} ส่งได้ {2} จาก {3}"
                    },
                    "Key": "LimiterBeltConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Bottleneck: {0}"
                    },
                    "Translation": {
                        "Text": "คอขวด: {0}"
                    },
                    "Key": "LimiterNameFmt"
                },
                {
                    "Source": {
                        "Text": "CLEAR PINGS"
                    },
                    "Translation": {
                        "Text": "ล้างหมุด"
                    },
                    "Key": "ClearPings"
                },
                {
                    "Source": {
                        "Text": "COLLECTED IN THE WORLD · no machine makes this; {0} is drawn from what you carry in and store"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceWorldGatheredFmt"
                },
                {
                    "Source": {
                        "Text": "CONSUMER NEED"
                    },
                    "Translation": {
                        "Text": "ความต้องการผู้ใช้"
                    },
                    "Key": "BalanceDemand"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS"
                    },
                    "Translation": {
                        "Text": "ผู้ใช้"
                    },
                    "Key": "BalanceConsumersHeading"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but none of them are running"
                    },
                    "Translation": {
                        "Text": "เครื่องที่ใช้หยุดทำงาน · เครื่องจักร {0} เครื่องที่นี่จะใช้ {1} แต่ไม่มีเครื่องใดทำงานอยู่"
                    },
                    "Key": "BalanceConsumersStoppedFmt"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but their own output is backed up"
                    },
                    "Translation": {
                        "Text": "เครื่องที่ใช้หยุดทำงาน · เครื่องจักร {0} เครื่องที่นี่จะใช้ {1} แต่เอาต์พุตของตัวเองตัน"
                    },
                    "Key": "BalanceConsumersBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "CRITICAL PATH"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "PanelTitle"
                },
                {
                    "Source": {
                        "Text": "Checking your factory…"
                    },
                    "Translation": {
                        "Text": "กำลังตรวจสอบโรงงานของคุณ…"
                    },
                    "Key": "BalancePending"
                },
                {
                    "Source": {
                        "Text": "Click to show/hide the blocker chain"
                    },
                    "Translation": {
                        "Text": "คลิกเพื่อแสดง/ซ่อนลำดับสาเหตุที่ติดขัด"
                    },
                    "Key": "TipChainHint"
                },
                {
                    "Source": {
                        "Text": "Could not measure what is arriving - check the belts and pipes feeding this"
                    },
                    "Translation": {
                        "Text": "วัดปริมาณที่เข้ามาไม่ได้ - ตรวจสอบสายพานและท่อที่ป้อนเข้ามา"
                    },
                    "Key": "BlockSolvedConnectivityUnknown"
                },
                {
                    "Source": {
                        "Text": "Critical Path could not find a player to ask the host on behalf of."
                    },
                    "Translation": {
                        "Text": "Critical Path ไม่พบผู้เล่นที่จะใช้ขอข้อมูลจากโฮสต์แทนได้"
                    },
                    "Key": "NoControllerDetail"
                },
                {
                    "Source": {
                        "Text": "Current milestone is fully paid - collect it and select the next one at the HUB."
                    },
                    "Translation": {
                        "Text": "ไมล์สโตนปัจจุบันจ่ายครบแล้ว - ไปรับและเลือกอันถัดไปที่ HUB"
                    },
                    "Key": "MilestonePaid"
                },
                {
                    "Source": {
                        "Text": "DRAWN FROM STORAGE · nothing is making this; the {0} you have banked covers about {1} min at this rate"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceStockedByHandRunwayFmt"
                },
                {
                    "Source": {
                        "Text": "DRAWN FROM STORAGE · nothing is making this; {0} banked is all there is"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceStockedByHandFmt"
                },
                {
                    "Source": {
                        "Text": "Delivered"
                    },
                    "Translation": {
                        "Text": "ส่งมอบแล้ว"
                    },
                    "Key": "StatusDelivered"
                },
                {
                    "Source": {
                        "Text": "Delivered: all {0}"
                    },
                    "Translation": {
                        "Text": "ส่งมอบแล้ว: ครบทั้ง {0}"
                    },
                    "Key": "TipDeliveredFmt"
                },
                {
                    "Source": {
                        "Text": "Delivery rates are not available right now. Machine status and built capacity are shown below."
                    },
                    "Translation": {
                        "Text": "ขณะนี้ไม่มีข้อมูลอัตราการส่งมอบ ด้านล่างแสดงสถานะเครื่องจักรและกำลังที่สร้างไว้"
                    },
                    "Key": "BalanceUnknown"
                },
                {
                    "Source": {
                        "Text": "EST. CURRENT OUTPUT"
                    },
                    "Translation": {
                        "Text": "ผลผลิตปัจจุบัน (ประมาณ)"
                    },
                    "Key": "BalanceEstimatedOutput"
                },
                {
                    "Source": {
                        "Text": "EST. CURRENT USE"
                    },
                    "Translation": {
                        "Text": "การใช้ปัจจุบัน (ประมาณ)"
                    },
                    "Key": "BalanceEstimatedUse"
                },
                {
                    "Source": {
                        "Text": "Elevator"
                    },
                    "Translation": {
                        "Text": "ลิฟต์อวกาศ"
                    },
                    "Key": "SectionElevatorNone"
                },
                {
                    "Source": {
                        "Text": "Elevator: {0}"
                    },
                    "Translation": {
                        "Text": "ลิฟต์อวกาศ: {0}"
                    },
                    "Key": "SectionElevatorFmt"
                },
                {
                    "Source": {
                        "Text": "Every line feeding your objective: what it makes, what arrives, and how long your stock lasts."
                    },
                    "Translation": {
                        "Text": "ทุกสายการผลิตที่ป้อนเป้าหมายของคุณ: ผลิตอะไร มีอะไรเข้ามา และสต็อกอยู่ได้นานเท่าใด"
                    },
                    "Key": "BalanceIntro"
                },
                {
                    "Source": {
                        "Text": "Extraction {0}/min vs demand {1}/min - add or upgrade extractors"
                    },
                    "Translation": {
                        "Text": "การสกัด {0}/นาที เทียบกับความต้องการ {1}/นาที - เพิ่มหรืออัพเกรดเครื่องสกัด"
                    },
                    "Key": "BlockExtractFmt"
                },
                {
                    "Source": {
                        "Text": "HUB"
                    },
                    "Translation": {
                        "Text": "HUB"
                    },
                    "Key": "SrcTutorial"
                },
                {
                    "Source": {
                        "Text": "It is being made, but no belt or pipe connects it to what needs it"
                    },
                    "Translation": {
                        "Text": "มีการผลิตอยู่ แต่ไม่มีสายพานหรือท่อเชื่อมไปยังจุดที่ต้องใช้"
                    },
                    "Key": "BlockNotConnected"
                },
                {
                    "Source": {
                        "Text": "JAMMED"
                    },
                    "Translation": {
                        "Text": "อุดตัน"
                    },
                    "Key": "BalanceProblemJammed"
                },
                {
                    "Source": {
                        "Text": "LOCATE"
                    },
                    "Translation": {
                        "Text": "ระบุตำแหน่ง"
                    },
                    "Key": "LocateEndpoint"
                },
                {
                    "Source": {
                        "Text": "LOCATE CONSUMER"
                    },
                    "Translation": {
                        "Text": "ระบุตำแหน่งผู้ใช้"
                    },
                    "Key": "LocateConsumer"
                },
                {
                    "Source": {
                        "Text": "LOCATE PRODUCER"
                    },
                    "Translation": {
                        "Text": "ระบุตำแหน่งผู้ผลิต"
                    },
                    "Key": "LocateProducer"
                },
                {
                    "Source": {
                        "Text": "Line exists but is STOPPED - fix it"
                    },
                    "Translation": {
                        "Text": "มีสายการผลิตแล้วแต่หยุดทำงาน - แก้ไข"
                    },
                    "Key": "PlanGraftStopped"
                },
                {
                    "Source": {
                        "Text": "Line exists but is STOPPED - fix the {0}"
                    },
                    "Translation": {
                        "Text": "มีสายการผลิตแล้วแต่หยุดทำงาน - แก้ไข {0}"
                    },
                    "Key": "PlanGraftStoppedFmt"
                },
                {
                    "Source": {
                        "Text": "MACHINE STATUS ONLY · delivery rates are not available right now"
                    },
                    "Translation": {
                        "Text": "แสดงเฉพาะสถานะเครื่องจักร · ขณะนี้ไม่มีข้อมูลอัตราการส่งมอบ"
                    },
                    "Key": "BalancePartialEvidence"
                },
                {
                    "Source": {
                        "Text": "MACHINES RUNNING SLOW · using about {0} of {1}; {2} machine(s) are short of ingredients"
                    },
                    "Translation": {
                        "Text": "เครื่องจักรทำงานช้า · ใช้อยู่ประมาณ {0} จาก {1}; เครื่องจักร {2} เครื่องขาดวัตถุดิบ"
                    },
                    "Key": "BalanceObservedUseGapFmt"
                },
                {
                    "Source": {
                        "Text": "MAM"
                    },
                    "Translation": {
                        "Text": "MAM"
                    },
                    "Key": "SrcMAM"
                },
                {
                    "Source": {
                        "Text": "MISSING INPUT"
                    },
                    "Translation": {
                        "Text": "ขาดวัตถุดิบ"
                    },
                    "Key": "BalanceProblemStarved"
                },
                {
                    "Source": {
                        "Text": "Machine contents and storage are tracked by the host, so Critical Path is requesting the report from there. This can take a few seconds on a large factory."
                    },
                    "Translation": {
                        "Text": "สิ่งที่อยู่ในเครื่องจักรและคลังถูกติดตามโดยโฮสต์ Critical Path จึงขอรายงานจากที่นั่น ในโรงงานขนาดใหญ่อาจใช้เวลาสองสามวินาที"
                    },
                    "Key": "AskingHostDetail"
                },
                {
                    "Source": {
                        "Text": "Machines here can make {0}; the machines using it need {1}"
                    },
                    "Translation": {
                        "Text": "เครื่องจักรตรงนี้ผลิตได้ {0}; เครื่องจักรที่นำไปใช้ต้องการ {1}"
                    },
                    "Key": "LimiterInstalledConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Milestone"
                    },
                    "Translation": {
                        "Text": "ไมล์สโตน"
                    },
                    "Key": "SectionMilestoneNone"
                },
                {
                    "Source": {
                        "Text": "Milestone: {0}"
                    },
                    "Translation": {
                        "Text": "ไมล์สโตน: {0}"
                    },
                    "Key": "SectionMilestoneFmt"
                },
                {
                    "Source": {
                        "Text": "NEED FIRST"
                    },
                    "Translation": {
                        "Text": "ความต้องการก่อน"
                    },
                    "Key": "BalanceSortNeedFirst"
                },
                {
                    "Source": {
                        "Text": "NEEDS ATTENTION"
                    },
                    "Translation": {
                        "Text": "ต้องดูแล"
                    },
                    "Key": "BalanceProblemAttention"
                },
                {
                    "Source": {
                        "Text": "NEXT - {0}: {1}."
                    },
                    "Translation": {
                        "Text": "ถัดไป - {0}: {1}."
                    },
                    "Key": "VerdictNextFmt"
                },
                {
                    "Source": {
                        "Text": "NEXT STEPS - the plan ({0} step(s)):"
                    },
                    "Translation": {
                        "Text": "ขั้นตอนถัดไป - แผนงาน ({0} ขั้นตอน):"
                    },
                    "Key": "VerdictPlanHeadFmt"
                },
                {
                    "Source": {
                        "Text": "NEXT STEPS - {0} step(s) to deliver {1}"
                    },
                    "Translation": {
                        "Text": "ขั้นตอนถัดไป - อีก {0} ขั้นตอนเพื่อส่งมอบ {1}"
                    },
                    "Key": "VerdictPlanDeliverFmt"
                },
                {
                    "Source": {
                        "Text": "NO POWER"
                    },
                    "Translation": {
                        "Text": "ไม่มีไฟฟ้า"
                    },
                    "Key": "BalanceProblemNoPower"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH ARRIVING · {0} is getting through; {1} is needed"
                    },
                    "Translation": {
                        "Text": "เข้ามาไม่พอ · ผ่านเข้ามา {0}; ต้องการ {1}"
                    },
                    "Key": "BalanceModeledDeliveryGapFmt"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH MACHINES · build at least {0} more production"
                    },
                    "Translation": {
                        "Text": "เครื่องจักรไม่พอ · สร้างกำลังผลิตเพิ่มอย่างน้อย {0}"
                    },
                    "Key": "BalanceCapacityGapFmt"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH MACHINES · {0} short, and some machines are stopped as well"
                    },
                    "Translation": {
                        "Text": "เครื่องจักรไม่พอ · ขาดอีก {0} และบางเครื่องยังหยุดทำงานด้วย"
                    },
                    "Key": "BalanceCapacityMachineGapsFmt"
                },
                {
                    "Source": {
                        "Text": "NOT REACHING THE MACHINES · {0} producer(s) backed up while {1} consumer(s) sit starved - this is routing, not capacity"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceDistributionFmt"
                },
                {
                    "Source": {
                        "Text": "NOTHING IS USING THIS · it is only filling storage right now"
                    },
                    "Translation": {
                        "Text": "ไม่มีอะไรใช้สิ่งนี้ · ขณะนี้เข้าไปเก็บในคลังเท่านั้น"
                    },
                    "Key": "BalanceNoDemand"
                },
                {
                    "Source": {
                        "Text": "Needs a fix"
                    },
                    "Translation": {
                        "Text": "ต้องแก้ไข"
                    },
                    "Key": "StatusNeedsFix"
                },
                {
                    "Source": {
                        "Text": "No balance rows match this filter."
                    },
                    "Translation": {
                        "Text": "ไม่มีแถวสมดุลที่ตรงกับตัวกรองนี้"
                    },
                    "Key": "BalanceNoMatches"
                },
                {
                    "Source": {
                        "Text": "No inputs arriving (check connections and supply)"
                    },
                    "Translation": {
                        "Text": "ไม่มีวัตถุดิบเข้ามา (ตรวจสอบการเชื่อมต่อและการจ่าย)"
                    },
                    "Key": "BlockInputsStarved"
                },
                {
                    "Source": {
                        "Text": "No inputs arriving - {0} of {1} machine(s) starved (check connections and supply)"
                    },
                    "Translation": {
                        "Text": "ไม่มีวัตถุดิบเข้ามา - เครื่องจักร {0} จาก {1} เครื่องขาดวัตถุดิบ (ตรวจสอบการเชื่อมต่อและการจ่าย)"
                    },
                    "Key": "BlockInputsStarvedFmt"
                },
                {
                    "Source": {
                        "Text": "No known source"
                    },
                    "Translation": {
                        "Text": "ไม่ทราบแหล่งที่มา"
                    },
                    "Key": "PlanUnknown"
                },
                {
                    "Source": {
                        "Text": "No line - build one"
                    },
                    "Translation": {
                        "Text": "ยังไม่มีสายการผลิต - สร้างขึ้นมา"
                    },
                    "Key": "PlanLine"
                },
                {
                    "Source": {
                        "Text": "No line - build: {0}"
                    },
                    "Translation": {
                        "Text": "ยังไม่มีสายการผลิต - สร้าง: {0}"
                    },
                    "Key": "PlanLineFmt"
                },
                {
                    "Source": {
                        "Text": "No line feeding your objective is in this state ({0}). Nothing to fix here."
                    },
                    "Translation": {
                        "Text": "ไม่มีสายการผลิตที่ป้อนเป้าหมายของคุณอยู่ในสถานะนี้ ({0}) ไม่มีอะไรต้องแก้ไขที่นี่"
                    },
                    "Key": "BalanceNoProblemMatches"
                },
                {
                    "Source": {
                        "Text": "No line feeding your objective matches this filter."
                    },
                    "Translation": {
                        "Text": "ไม่มีสายการผลิตที่ป้อนเป้าหมายของคุณตรงกับตัวกรองนี้"
                    },
                    "Key": "BalanceNoMatchesSearch"
                },
                {
                    "Source": {
                        "Text": "No machine can make this - you collect it out in the world and carry it back"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BlockWorldGathered"
                },
                {
                    "Source": {
                        "Text": "No milestone selected - {0} available. Choose one at the HUB."
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้เลือกไมล์สโตน - มี {0} ให้เลือก เลือกได้ที่ HUB"
                    },
                    "Key": "MilestoneNoneSelectedFmt"
                },
                {
                    "Source": {
                        "Text": "No milestones available in this elevator phase."
                    },
                    "Translation": {
                        "Text": "ไม่มีไมล์สโตนในเฟสลิฟต์อวกาศนี้"
                    },
                    "Key": "MilestoneNoneAvailable"
                },
                {
                    "Source": {
                        "Text": "No outstanding Space Elevator phase."
                    },
                    "Translation": {
                        "Text": "ไม่มีเฟสลิฟต์อวกาศที่ค้างอยู่"
                    },
                    "Key": "ElevatorNone"
                },
                {
                    "Source": {
                        "Text": "No outstanding objectives."
                    },
                    "Translation": {
                        "Text": "ไม่มีเป้าหมายที่ค้างอยู่"
                    },
                    "Key": "VerdictNone"
                },
                {
                    "Source": {
                        "Text": "No power - {0} of {1} machine(s) dark"
                    },
                    "Translation": {
                        "Text": "ไม่มีไฟฟ้า - เครื่องจักร {0} จาก {1} เครื่องดับอยู่"
                    },
                    "Key": "BlockNoPowerCountFmt"
                },
                {
                    "Source": {
                        "Text": "No recipe by design - spent fuel: burn {0} in a Nuclear Power Plant"
                    },
                    "Translation": {
                        "Text": "ไม่มีสูตรโดยการออกแบบ - เชื้อเพลิงใช้แล้ว: เผา {0} ในโรงไฟฟ้านิวเคลียร์"
                    },
                    "Key": "GapSpentFuelFmt"
                },
                {
                    "Source": {
                        "Text": "Not built yet"
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้สร้าง"
                    },
                    "Key": "StatusNotBuiltDefault"
                },
                {
                    "Source": {
                        "Text": "Not built yet"
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้สร้าง"
                    },
                    "Key": "StatusNotBuilt"
                },
                {
                    "Source": {
                        "Text": "Not connected to a game"
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้เชื่อมต่อกับเกม"
                    },
                    "Key": "NoControllerHeadline"
                },
                {
                    "Source": {
                        "Text": "Nothing on your objective path has a production line yet."
                    },
                    "Translation": {
                        "Text": "ยังไม่มีสิ่งใดบนเส้นทางเป้าหมายของคุณที่มีสายการผลิต"
                    },
                    "Key": "BalanceEmpty"
                },
                {
                    "Source": {
                        "Text": "Nothing produces it - build a line"
                    },
                    "Translation": {
                        "Text": "ไม่มีอะไรผลิตสิ่งนี้ - สร้างสายการผลิต"
                    },
                    "Key": "BlockNoProducer"
                },
                {
                    "Source": {
                        "Text": "ON TRACK - ~{0} min of production remain ({1} is the long pole)."
                    },
                    "Translation": {
                        "Text": "เป็นไปตามแผน - เหลือการผลิตอีกประมาณ {0} นาที ({1} คือตัวที่ช้าที่สุด)"
                    },
                    "Key": "VerdictEtaFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is available for {1}/min needed ({2}%); some delivery routes could not be checked"
                    },
                    "Translation": {
                        "Text": "มีเพียง {0}/นาที สำหรับที่ต้องการ {1}/นาที ({2}%); ตรวจสอบเส้นทางส่งมอบบางเส้นไม่ได้"
                    },
                    "Key": "LimiterAggFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is getting through; the machines on this line need {1}/min ({2}%)"
                    },
                    "Translation": {
                        "Text": "ผ่านเข้ามาเพียง {0}/นาที; เครื่องจักรในสายการผลิตนี้ต้องการ {1}/นาที ({2}%)"
                    },
                    "Key": "LimiterSolvedFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is reaching this line; it needs {1}/min"
                    },
                    "Translation": {
                        "Text": "ถึงสายการผลิตนี้เพียง {0}/นาที; ต้องการ {1}/นาที"
                    },
                    "Key": "BlockSolvedSupplyFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is reaching this line; it needs {1}/min - add or upgrade extraction"
                    },
                    "Translation": {
                        "Text": "ถึงสายการผลิตนี้เพียง {0}/นาที; ต้องการ {1}/นาที - เพิ่มหรืออัพเกรดการสกัด"
                    },
                    "Key": "BlockSolvedExtractFmt"
                },
                {
                    "Source": {
                        "Text": "Outputs full"
                    },
                    "Translation": {
                        "Text": "ช่องผลผลิตเต็ม"
                    },
                    "Key": "BlockOutputsFull"
                },
                {
                    "Source": {
                        "Text": "Outputs full - {0} has no connected destination and may be backing up (check its disposal)"
                    },
                    "Translation": {
                        "Text": "ช่องผลผลิตเต็ม - {0} ไม่มีปลายทางที่เชื่อมต่อและอาจล้นย้อนกลับ (ตรวจสอบการกำจัดทิ้ง)"
                    },
                    "Key": "BlockByproductFmt"
                },
                {
                    "Source": {
                        "Text": "Outputs full - {0} of {1} machine(s) stalled"
                    },
                    "Translation": {
                        "Text": "ช่องผลผลิตเต็ม - เครื่องจักร {0} จาก {1} เครื่องหยุดนิ่ง"
                    },
                    "Key": "BlockOutputsFullFmt"
                },
                {
                    "Source": {
                        "Text": "Owned: {0} in storage  ·  {1} in depot  ·  {2} carried"
                    },
                    "Translation": {
                        "Text": "ครอบครอง: {0} ในคลัง  ·  {1} ในคลังมิติ  ·  {2} พกติดตัว"
                    },
                    "Key": "TipOwnedFmt"
                },
                {
                    "Source": {
                        "Text": "PATH"
                    },
                    "Translation": {
                        "Text": "เส้นทาง"
                    },
                    "Key": "TabPath"
                },
                {
                    "Source": {
                        "Text": "PAUSED"
                    },
                    "Translation": {
                        "Text": "หยุดชั่วคราว"
                    },
                    "Key": "BalanceProblemPaused"
                },
                {
                    "Source": {
                        "Text": "PLAN"
                    },
                    "Translation": {
                        "Text": "แผนงาน"
                    },
                    "Key": "TabPlan"
                },
                {
                    "Source": {
                        "Text": "POWER SHARDS"
                    },
                    "Translation": {
                        "Text": "เศษพลังงาน"
                    },
                    "Key": "BalanceAugmentShards"
                },
                {
                    "Source": {
                        "Text": "PRODUCED ELSEWHERE · this item is made somewhere in your factory, but no belt or pipe route reaches this line. If a teleporter, portal or loader feeds it, that link cannot be followed"
                    },
                    "Translation": {
                        "Text": "ผลิตที่อื่น · ไอเทมนี้ถูกผลิตที่ใดที่หนึ่งในโรงงานของคุณ แต่ไม่มีเส้นทางสายพานหรือท่อมาถึงสายการผลิตนี้ หากมีเทเลพอร์เตอร์ พอร์ทัล หรือโหลดเดอร์ป้อนอยู่ ระบบจะติดตามการเชื่อมนั้นไม่ได้"
                    },
                    "Key": "BalanceProducedElsewhere"
                },
                {
                    "Source": {
                        "Text": "PRODUCER ISSUES · {0} missing input · {1} output blocked · {2} no power"
                    },
                    "Translation": {
                        "Text": "ปัญหาที่ผู้ผลิต · {0} ขาดวัตถุดิบ · {1} ทางออกถูกปิดกั้น · {2} ไม่มีไฟฟ้า"
                    },
                    "Key": "BalanceProducerIssueFmt"
                },
                {
                    "Source": {
                        "Text": "PRODUCERS"
                    },
                    "Translation": {
                        "Text": "ผู้ผลิต"
                    },
                    "Key": "BalanceProducersHeading"
                },
                {
                    "Source": {
                        "Text": "Pipe bottleneck: {0} → {1} carries {2} of {3}"
                    },
                    "Translation": {
                        "Text": "คอขวดท่อ: {0} → {1} ส่งได้ {2} จาก {3}"
                    },
                    "Key": "LimiterPipeConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Producers have no power"
                    },
                    "Translation": {
                        "Text": "ผู้ผลิตไม่มีไฟฟ้า"
                    },
                    "Key": "BlockNoPower"
                },
                {
                    "Source": {
                        "Text": "Producing at {0}/min"
                    },
                    "Translation": {
                        "Text": "กำลังผลิตที่ {0}/นาที"
                    },
                    "Key": "TipRateFmt"
                },
                {
                    "Source": {
                        "Text": "Production exists, but none reaches the machines that need it"
                    },
                    "Translation": {
                        "Text": "มีการผลิตอยู่ แต่ไม่มีสิ่งใดไปถึงเครื่องจักรที่ต้องใช้"
                    },
                    "Key": "BlockSolvedNotConnected"
                },
                {
                    "Source": {
                        "Text": "READY - every remaining part is banked. Delivery is the only step left."
                    },
                    "Translation": {
                        "Text": "พร้อม - ชิ้นส่วนที่เหลือทั้งหมดมีเก็บไว้แล้ว เหลือเพียงขั้นตอนส่งมอบ"
                    },
                    "Key": "VerdictReady"
                },
                {
                    "Source": {
                        "Text": "REFRESH"
                    },
                    "Translation": {
                        "Text": "รีเฟรช"
                    },
                    "Key": "RefreshReport"
                },
                {
                    "Source": {
                        "Text": "Raw resource - extract it"
                    },
                    "Translation": {
                        "Text": "ทรัพยากรดิบ - ทำการสกัด"
                    },
                    "Key": "PlanRaw"
                },
                {
                    "Source": {
                        "Text": "Ready to deliver"
                    },
                    "Translation": {
                        "Text": "พร้อมส่งมอบ"
                    },
                    "Key": "StatusReadyToDeliver"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - no purchasable research yet"
                    },
                    "Translation": {
                        "Text": "สูตรถูกล็อก - ยังไม่มีงานวิจัยที่ซื้อได้"
                    },
                    "Key": "GapNoUnlock"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - research: {0}"
                    },
                    "Translation": {
                        "Text": "สูตรถูกล็อก - งานวิจัย: {0}"
                    },
                    "Key": "GapUnlockFmt"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - research: {0} ({1})"
                    },
                    "Translation": {
                        "Text": "สูตรถูกล็อก - งานวิจัย: {0} ({1})"
                    },
                    "Key": "GapUnlockSrcFmt"
                },
                {
                    "Source": {
                        "Text": "Recipe not researched"
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้วิจัยสูตรนี้"
                    },
                    "Key": "StatusRecipeLocked"
                },
                {
                    "Source": {
                        "Text": "Recipe not researched"
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้วิจัยสูตรนี้"
                    },
                    "Key": "PlanLocked"
                },
                {
                    "Source": {
                        "Text": "Research needed upstream"
                    },
                    "Translation": {
                        "Text": "ต้องมีงานวิจัยในสายต้นน้ำ"
                    },
                    "Key": "SectionResearch"
                },
                {
                    "Source": {
                        "Text": "Research: {0}"
                    },
                    "Translation": {
                        "Text": "งานวิจัย: {0}"
                    },
                    "Key": "StatusResearchFmt"
                },
                {
                    "Source": {
                        "Text": "Reserve line (standby)"
                    },
                    "Translation": {
                        "Text": "สายการผลิตสำรอง (สแตนด์บาย)"
                    },
                    "Key": "StatusStandbyReserve"
                },
                {
                    "Source": {
                        "Text": "Route not measured"
                    },
                    "Translation": {
                        "Text": "ยังไม่ได้วัดเส้นทาง"
                    },
                    "Key": "StatusRouteUnknown"
                },
                {
                    "Source": {
                        "Text": "SERVING CURRENT USE · consumers are using about {0} against {1} demand"
                    },
                    "Translation": {
                        "Text": "รองรับการใช้งานปัจจุบัน · ผู้ใช้กำลังใช้ประมาณ {0} จากความต้องการ {1}"
                    },
                    "Key": "BalanceObservedUseHealthyFmt"
                },
                {
                    "Source": {
                        "Text": "SOMERSLOOPS"
                    },
                    "Translation": {
                        "Text": "SOMERSLOOPS"
                    },
                    "Key": "BalanceAugmentSloops"
                },
                {
                    "Source": {
                        "Text": "STALE - {0}s old (refresh failed)"
                    },
                    "Translation": {
                        "Text": "ข้อมูลเก่า - {0} วินาทีที่แล้ว (รีเฟรชไม่สำเร็จ)"
                    },
                    "Key": "AgeStaleFmt"
                },
                {
                    "Source": {
                        "Text": "STOCKPILING FOR YOUR OBJECTIVE · no machine draws this; you deliver it yourself"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceObjectiveStock"
                },
                {
                    "Source": {
                        "Text": "SUPPLY LINE  can send {0}  ·  actually arriving {1}"
                    },
                    "Translation": {
                        "Text": "สายส่ง  ส่งได้ {0}  ·  มาถึงจริง {1}"
                    },
                    "Key": "BalanceModelFmt"
                },
                {
                    "Source": {
                        "Text": "SUPPLY MEETS NEED · {0} is reaching consumers; they need {1}"
                    },
                    "Translation": {
                        "Text": "อุปทานพอกับความต้องการ · {0} ไปถึงผู้ใช้; ต้องการ {1}"
                    },
                    "Key": "BalanceModeledHealthyFmt"
                },
                {
                    "Source": {
                        "Text": "Saturated (surplus)"
                    },
                    "Translation": {
                        "Text": "อิ่มตัว (เกินความต้องการ)"
                    },
                    "Key": "StatusSaturated"
                },
                {
                    "Source": {
                        "Text": "Search items or buildings, then press Enter"
                    },
                    "Translation": {
                        "Text": "ค้นหาไอเทมหรืออาคาร แล้วกด Enter"
                    },
                    "Key": "BalanceFilterHint"
                },
                {
                    "Source": {
                        "Text": "Separate track:"
                    },
                    "Translation": {
                        "Text": "เส้นทางแยก:"
                    },
                    "Key": "PlanExcludedLead"
                },
                {
                    "Source": {
                        "Text": "Showing the {0} lines needing the most attention, of {1} feeding your objective. Search, or filter by problem, to narrow this down."
                    },
                    "Translation": {
                        "Text": "กำลังแสดง {0} สายการผลิตที่ต้องดูแลมากที่สุด จากทั้งหมด {1} สายที่ป้อนเป้าหมายของคุณ ใช้การค้นหาหรือกรองตามปัญหาเพื่อจำกัดผลลัพธ์"
                    },
                    "Key": "BalanceRowsTruncatedFmt"
                },
                {
                    "Source": {
                        "Text": "Showing the {0} lines needing the most attention, of {1} matching your filter."
                    },
                    "Translation": {
                        "Text": "กำลังแสดง {0} สายการผลิตที่ต้องดูแลมากที่สุด จากทั้งหมด {1} สายที่ตรงกับตัวกรองของคุณ"
                    },
                    "Key": "BalanceRowsTruncatedFilteredFmt"
                },
                {
                    "Source": {
                        "Text": "Showing {0} of {1} - the rest are counted in the totals above but not listed."
                    },
                    "Translation": {
                        "Text": "กำลังแสดง {0} จาก {1} - ส่วนที่เหลือถูกนับรวมในยอดด้านบนแต่ไม่ได้แสดงรายการ"
                    },
                    "Key": "BalanceEndpointsTruncatedFmt"
                },
                {
                    "Source": {
                        "Text": "Spent fuel - burn {0} in a Nuclear Power Plant"
                    },
                    "Translation": {
                        "Text": "เชื้อเพลิงใช้แล้ว - เผา {0} ในโรงไฟฟ้านิวเคลียร์"
                    },
                    "Key": "PlanSpentFuelFmt"
                },
                {
                    "Source": {
                        "Text": "Starved - the delivery path could not be fully checked; inspect its connections"
                    },
                    "Translation": {
                        "Text": "ขาดวัตถุดิบ - ตรวจสอบเส้นทางส่งมอบได้ไม่ครบ; ตรวจดูการเชื่อมต่อ"
                    },
                    "Key": "BlockConnectivityUnknown"
                },
                {
                    "Source": {
                        "Text": "Still needed: {0}  (banked {1}, to produce {2})"
                    },
                    "Translation": {
                        "Text": "ยังต้องการ: {0}  (เก็บไว้แล้ว {1}, ต้องผลิตอีก {2})"
                    },
                    "Key": "TipNeededFmt"
                },
                {
                    "Source": {
                        "Text": "Supply {0}/min vs demand {1}/min - add capacity"
                    },
                    "Translation": {
                        "Text": "อุปทาน {0}/นาที เทียบกับความต้องการ {1}/นาที - เพิ่มกำลังผลิต"
                    },
                    "Key": "BlockSupplyFmt"
                },
                {
                    "Source": {
                        "Text": "The feeding line could not be identified - inspect the connected producers"
                    },
                    "Translation": {
                        "Text": "ระบุสายการผลิตที่ป้อนเข้ามาไม่ได้ - ตรวจดูผู้ผลิตที่เชื่อมต่ออยู่"
                    },
                    "Key": "BlockPathAttributionMissing"
                },
                {
                    "Source": {
                        "Text": "The host cannot send a report"
                    },
                    "Translation": {
                        "Text": "โฮสต์ไม่สามารถส่งรายงานได้"
                    },
                    "Key": "NoRelayHeadline"
                },
                {
                    "Source": {
                        "Text": "The host could not produce a report"
                    },
                    "Translation": {
                        "Text": "โฮสต์ไม่สามารถสร้างรายงานได้"
                    },
                    "Key": "HostDeclinedHeadline"
                },
                {
                    "Source": {
                        "Text": "The machines can supply {0}, but only {1} reaches consumers; inspect the route between them"
                    },
                    "Translation": {
                        "Text": "เครื่องจักรจ่ายได้ {0} แต่ไปถึงผู้ใช้เพียง {1}; ตรวจดูเส้นทางระหว่างกัน"
                    },
                    "Key": "LimiterRoutingConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "This client asked the host for a report, but the host is not running a version of Critical Path that can send one. Ask the host to update, or open the panel on the host."
                    },
                    "Translation": {
                        "Text": "ไคลเอนต์นี้ขอรายงานจากโฮสต์แล้ว แต่โฮสต์ใช้ Critical Path เวอร์ชันที่ส่งรายงานไม่ได้ ให้โฮสต์อัพเดต หรือเปิดแผงควบคุมบนเครื่องโฮสต์"
                    },
                    "Key": "NoRelayDetail"
                },
                {
                    "Source": {
                        "Text": "This reading is out of date - press REFRESH"
                    },
                    "Translation": {
                        "Text": "ค่าที่อ่านได้นี้ล้าสมัย - กดรีเฟรช"
                    },
                    "Key": "BlockLegacyLogistics"
                },
                {
                    "Source": {
                        "Text": "Time-limited"
                    },
                    "Translation": {
                        "Text": "จำกัดเวลา"
                    },
                    "Key": "StatusTimeLimited"
                },
                {
                    "Source": {
                        "Text": "To research {0}  ({1}):"
                    },
                    "Translation": {
                        "Text": "เพื่อวิจัย {0}  ({1}):"
                    },
                    "Key": "ResearchPlanHeadFmt"
                },
                {
                    "Source": {
                        "Text": "Transport route is known; vehicle throughput is not yet measured."
                    },
                    "Translation": {
                        "Text": "ทราบเส้นทางขนส่งแล้ว; ยังไม่ได้วัดปริมาณผ่านของยานพาหนะ"
                    },
                    "Key": "TransportTopologyOnly"
                },
                {
                    "Source": {
                        "Text": "Under-supplied"
                    },
                    "Translation": {
                        "Text": "จ่ายไม่พอ"
                    },
                    "Key": "StatusUnderSupplied"
                },
                {
                    "Source": {
                        "Text": "Unlocked by {0} - your SELECTED milestone: its payment progress is the Milestone column →"
                    },
                    "Translation": {
                        "Text": "ปลดล็อกโดย {0} - ไมล์สโตนที่คุณเลือกไว้: ความคืบหน้าการจ่ายอยู่ในคอลัมน์ไมล์สโตน →"
                    },
                    "Key": "ResearchIsSelectedFmt"
                },
                {
                    "Source": {
                        "Text": "Vehicle route connected - delivery rate unknown because throughput is not yet measured"
                    },
                    "Translation": {
                        "Text": "เส้นทางยานพาหนะเชื่อมต่อแล้ว - ไม่ทราบอัตราการส่งมอบเพราะยังไม่ได้วัดปริมาณผ่าน"
                    },
                    "Key": "BlockTransportRateUnknown"
                },
                {
                    "Source": {
                        "Text": "blocked by {0} on the belt"
                    },
                    "Translation": {
                        "Text": "ถูกขวางโดย {0} บนสายพาน"
                    },
                    "Key": "EndpointStateJammedFmt"
                },
                {
                    "Source": {
                        "Text": "buffer {0} {1}"
                    },
                    "Translation": {
                        "Text": "บัฟเฟอร์ {0} {1}"
                    },
                    "Key": "EndpointBufferFmt"
                },
                {
                    "Source": {
                        "Text": "downstream node"
                    },
                    "Translation": {
                        "Text": "โหนดปลายน้ำ"
                    },
                    "Key": "LimiterEdgeDownstreamFallback"
                },
                {
                    "Source": {
                        "Text": "from the host, earlier (latest request failed)"
                    },
                    "Translation": {
                        "Text": "จากโฮสต์ เมื่อครู่ (คำขอล่าสุดไม่สำเร็จ)"
                    },
                    "Key": "AgeHostStale"
                },
                {
                    "Source": {
                        "Text": "from the host, just now"
                    },
                    "Translation": {
                        "Text": "จากโฮสต์ เมื่อสักครู่"
                    },
                    "Key": "AgeFromHost"
                },
                {
                    "Source": {
                        "Text": "hard drive"
                    },
                    "Translation": {
                        "Text": "ฮาร์ดไดรฟ์"
                    },
                    "Key": "SrcHardDrive"
                },
                {
                    "Source": {
                        "Text": "idle - no fault reported"
                    },
                    "Translation": {
                        "Text": "ว่างงาน - ไม่มีรายงานข้อผิดพลาด"
                    },
                    "Key": "EndpointStateIdle"
                },
                {
                    "Source": {
                        "Text": "is not in this plan - its recipe is not unlocked yet"
                    },
                    "Translation": {
                        "Text": "ไม่อยู่ในแผนนี้ - ยังไม่ได้ปลดล็อกสูตร"
                    },
                    "Key": "PlanExcludedWhyUnknown"
                },
                {
                    "Source": {
                        "Text": "is not in this plan - its recipe unlocks with {0}"
                    },
                    "Translation": {
                        "Text": "ไม่อยู่ในแผนนี้ - สูตรจะปลดล็อกด้วย {0}"
                    },
                    "Key": "PlanExcludedWhyFmt"
                },
                {
                    "Source": {
                        "Text": "items"
                    },
                    "Translation": {
                        "Text": "ชิ้น"
                    },
                    "Key": "BufferItems"
                },
                {
                    "Source": {
                        "Text": "items"
                    },
                    "Translation": {
                        "Text": "ชิ้น"
                    },
                    "Key": "EndpointBufferItems"
                },
                {
                    "Source": {
                        "Text": "items/min"
                    },
                    "Translation": {
                        "Text": "ชิ้น/นาที"
                    },
                    "Key": "BalanceSolidRateUnit"
                },
                {
                    "Source": {
                        "Text": "just now"
                    },
                    "Translation": {
                        "Text": "เมื่อสักครู่"
                    },
                    "Key": "AgeJustNowFlow"
                },
                {
                    "Source": {
                        "Text": "just now"
                    },
                    "Translation": {
                        "Text": "เมื่อสักครู่"
                    },
                    "Key": "AgeJustNow"
                },
                {
                    "Source": {
                        "Text": "machine"
                    },
                    "Translation": {
                        "Text": "เครื่องจักร"
                    },
                    "Key": "LimiterMachineFallback"
                },
                {
                    "Source": {
                        "Text": "made by {0}  ·  used by {1}{2}"
                    },
                    "Translation": {
                        "Text": "ผลิตโดย {0}  ·  ใช้โดย {1}{2}"
                    },
                    "Key": "BalanceIdentityFmt"
                },
                {
                    "Source": {
                        "Text": "milestone"
                    },
                    "Translation": {
                        "Text": "ไมล์สโตน"
                    },
                    "Key": "SrcMilestone"
                },
                {
                    "Source": {
                        "Text": "missing input"
                    },
                    "Translation": {
                        "Text": "ขาดวัตถุดิบ"
                    },
                    "Key": "EndpointStateMissingInput"
                },
                {
                    "Source": {
                        "Text": "m³"
                    },
                    "Translation": {
                        "Text": "m³"
                    },
                    "Key": "EndpointBufferM3"
                },
                {
                    "Source": {
                        "Text": "m³"
                    },
                    "Translation": {
                        "Text": "m³"
                    },
                    "Key": "BufferM3"
                },
                {
                    "Source": {
                        "Text": "m³/min"
                    },
                    "Translation": {
                        "Text": "m³/min"
                    },
                    "Key": "BalanceFluidRateUnit"
                },
                {
                    "Source": {
                        "Text": "no connected consumer"
                    },
                    "Translation": {
                        "Text": "ไม่มีผู้ใช้ที่เชื่อมต่อ"
                    },
                    "Key": "BalanceNoConsumer"
                },
                {
                    "Source": {
                        "Text": "no data - {0}"
                    },
                    "Translation": {
                        "Text": "ไม่มีข้อมูล - {0}"
                    },
                    "Key": "AgeErrorFmt"
                },
                {
                    "Source": {
                        "Text": "no power"
                    },
                    "Translation": {
                        "Text": "ไม่มีไฟฟ้า"
                    },
                    "Key": "EndpointStateNoPower"
                },
                {
                    "Source": {
                        "Text": "no producer"
                    },
                    "Translation": {
                        "Text": "ไม่มีผู้ผลิต"
                    },
                    "Key": "BalanceNoProducer"
                },
                {
                    "Source": {
                        "Text": "output full (nothing taking it)"
                    },
                    "Translation": {
                        "Text": "ช่องผลผลิตเต็ม (ไม่มีอะไรมารับ)"
                    },
                    "Key": "EndpointStateOutputBlocked"
                },
                {
                    "Source": {
                        "Text": "paused"
                    },
                    "Translation": {
                        "Text": "หยุดชั่วคราว"
                    },
                    "Key": "EndpointStatePaused"
                },
                {
                    "Source": {
                        "Text": "producing"
                    },
                    "Translation": {
                        "Text": "กำลังผลิต"
                    },
                    "Key": "EndpointStateProducing"
                },
                {
                    "Source": {
                        "Text": "re-measuring..."
                    },
                    "Translation": {
                        "Text": "กำลังวัดใหม่..."
                    },
                    "Key": "AgeRefreshing"
                },
                {
                    "Source": {
                        "Text": "state unavailable"
                    },
                    "Translation": {
                        "Text": "ไม่ทราบสถานะ"
                    },
                    "Key": "EndpointStateUnavailable"
                },
                {
                    "Source": {
                        "Text": "the {0} elevator phase"
                    },
                    "Translation": {
                        "Text": "เฟสลิฟต์อวกาศ {0}"
                    },
                    "Key": "PlanForPhaseFmt"
                },
                {
                    "Source": {
                        "Text": "the {0} milestone"
                    },
                    "Translation": {
                        "Text": "ไมล์สโตน {0}"
                    },
                    "Key": "PlanForMilestoneFmt"
                },
                {
                    "Source": {
                        "Text": "unavailable here"
                    },
                    "Translation": {
                        "Text": "ไม่มีข้อมูลที่นี่"
                    },
                    "Key": "AgeUnavailable"
                },
                {
                    "Source": {
                        "Text": "upstream node"
                    },
                    "Translation": {
                        "Text": "โหนดต้นน้ำ"
                    },
                    "Key": "LimiterEdgeUpstreamFallback"
                },
                {
                    "Source": {
                        "Text": "waiting on {0}"
                    },
                    "Translation": {
                        "Text": "กำลังรอ {0}"
                    },
                    "Key": "EndpointStateStarvedFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Add 1 average {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  เพิ่ม {1} โดยเฉลี่ยอีก 1 → ประมาณ {2} จะไปถึงผู้ใช้ ({3}%)"
                    },
                    "Key": "LimiterExactMachineMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Alt recipes exist"
                    },
                    "Translation": {
                        "Text": "{0}  ·  มีสูตรทางเลือก"
                    },
                    "Key": "PlanAltFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Spare capacity unavailable - one or more routes could not be fully measured"
                    },
                    "Translation": {
                        "Text": "{0}  ·  ไม่ทราบกำลังผลิตส่วนเกิน - วัดเส้นทางอย่างน้อยหนึ่งเส้นได้ไม่ครบ"
                    },
                    "Key": "PlanGraftUnknownFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Spare {1}/min, needs {2}/min ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  เหลือ {1}/นาที, ต้องการ {2}/นาที ({3}%)"
                    },
                    "Key": "PlanGraftRatioFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Stored buffer covers ~{1} min"
                    },
                    "Translation": {
                        "Text": "{0}  ·  บัฟเฟอร์ที่เก็บไว้พอใช้ประมาณ {1} นาที"
                    },
                    "Key": "LimiterBufferFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Stored buffer is dry"
                    },
                    "Translation": {
                        "Text": "{0}  ·  บัฟเฟอร์ที่เก็บไว้หมดแล้ว"
                    },
                    "Key": "LimiterBufferDryFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Upgrade this belt to {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  อัพเกรดสายพานนี้เป็น {1} → ประมาณ {2} จะไปถึงผู้ใช้ ({3}%)"
                    },
                    "Key": "LimiterExactBeltMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Upgrade this pipe to {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  อัพเกรดท่อนี้เป็น {1} → ประมาณ {2} จะไปถึงผู้ใช้ ({3}%)"
                    },
                    "Key": "LimiterExactPipeMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  delivery rate unknown on {1} route(s)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  ไม่ทราบอัตราการส่งมอบใน {1} เส้นทาง"
                    },
                    "Key": "LimiterUnknownFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  line {1}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  สายการผลิต {1}"
                    },
                    "Key": "BalanceTitleMultiFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  more not shown"
                    },
                    "Translation": {
                        "Text": "{0}  ·  ยังมีอีกที่ไม่ได้แสดง"
                    },
                    "Key": "PlanTruncFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  one more {1} would reach {2}%"
                    },
                    "Translation": {
                        "Text": "{0}  ·  เพิ่ม {1} อีกหนึ่งจะถึง {2}%"
                    },
                    "Key": "LimiterMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  only {1} of {2} checked - too many to scan"
                    },
                    "Translation": {
                        "Text": "{0}  ·  ตรวจสอบเพียง {1} จาก {2} - มากเกินกว่าจะสแกนทั้งหมด"
                    },
                    "Key": "TruncFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1}"
                    },
                    "Key": "LimiterConstraintJoinFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1} checked - some supporting detail limited"
                    },
                    "Translation": {
                        "Text": "{0}  ·  ตรวจสอบแล้ว {1} - รายละเอียดประกอบบางส่วนถูกจำกัด"
                    },
                    "Key": "TruncDetailFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1}: {2}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1}: {2}"
                    },
                    "Key": "VerdictPlanFaultFmt"
                },
                {
                    "Source": {
                        "Text": "{0} ({1})"
                    },
                    "Translation": {
                        "Text": "{0} ({1})"
                    },
                    "Key": "PlanUnlockNameFmt"
                },
                {
                    "Source": {
                        "Text": "{0} - {1}"
                    },
                    "Translation": {
                        "Text": "{0} - {1}"
                    },
                    "Key": "BalanceAnchorPingFmt"
                },
                {
                    "Source": {
                        "Text": "{0} - {1} - {2}"
                    },
                    "Translation": {
                        "Text": "{0} - {1} - {2}"
                    },
                    "Key": "BalanceEndpointPingFmt"
                },
                {
                    "Source": {
                        "Text": "{0} delivered"
                    },
                    "Translation": {
                        "Text": "ส่งมอบแล้ว {0}"
                    },
                    "Key": "SummaryDoneFmt"
                },
                {
                    "Source": {
                        "Text": "{0} delivered"
                    },
                    "Translation": {
                        "Text": "ส่งมอบแล้ว {0}"
                    },
                    "Key": "LedgerDeliveredFmt"
                },
                {
                    "Source": {
                        "Text": "{0} need a fix"
                    },
                    "Translation": {
                        "Text": "{0} ต้องแก้ไข"
                    },
                    "Key": "SummaryBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {0} banked  ·  {1}"
                    },
                    "Translation": {
                        "Text": "ต้องการ {0}  ·  เก็บไว้แล้ว {0}  ·  {1}"
                    },
                    "Key": "LedgerBankedFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1}"
                    },
                    "Translation": {
                        "Text": "ต้องการ {0}  ·  {1}"
                    },
                    "Key": "LedgerNoBankFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1} banked  ·  {2}"
                    },
                    "Translation": {
                        "Text": "ต้องการ {0}  ·  เก็บไว้แล้ว {1}  ·  {2}"
                    },
                    "Key": "ResearchCostLedgerFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1} banked  ·  {2} to produce  ·  {3}"
                    },
                    "Translation": {
                        "Text": "ต้องการ {0}  ·  เก็บไว้แล้ว {1}  ·  ต้องผลิตอีก {2}  ·  {3}"
                    },
                    "Key": "LedgerFullFmt"
                },
                {
                    "Source": {
                        "Text": "{0} ready to deliver"
                    },
                    "Translation": {
                        "Text": "{0} พร้อมส่งมอบ"
                    },
                    "Key": "SummaryReadyFmt"
                },
                {
                    "Source": {
                        "Text": "{0} still to build"
                    },
                    "Translation": {
                        "Text": "{0} ที่ยังต้องสร้าง"
                    },
                    "Key": "SummaryToBuildFmt"
                },
                {
                    "Source": {
                        "Text": "{0} {0}|plural(one=part,other=parts)"
                    },
                    "Translation": {
                        "Text": "{0} ชิ้น"
                    },
                    "Key": "SummaryPartsFmt"
                },
                {
                    "Source": {
                        "Text": "{0} {1}"
                    },
                    "Translation": {
                        "Text": "{0} {1}"
                    },
                    "Key": "BalanceRateWithUnitFmt"
                },
                {
                    "Source": {
                        "Text": "{0}% productivity"
                    },
                    "Translation": {
                        "Text": "ผลิตภาพ {0}%"
                    },
                    "Key": "EndpointProductivityFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Build:"
                    },
                    "Translation": {
                        "Text": "{0})  สร้าง:"
                    },
                    "Key": "PlanStepBuildFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Fix:"
                    },
                    "Translation": {
                        "Text": "{0})  แก้ไข:"
                    },
                    "Key": "PlanStepFixFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Unlock:"
                    },
                    "Translation": {
                        "Text": "{0})  ปลดล็อก:"
                    },
                    "Key": "PlanStepUnlockFmt"
                },
                {
                    "Source": {
                        "Text": "{0}. {1} - {2}"
                    },
                    "Translation": {
                        "Text": "{0}. {1} - {2}"
                    },
                    "Key": "BalanceEndpointFmt"
                },
                {
                    "Source": {
                        "Text": "~{0} min remaining"
                    },
                    "Translation": {
                        "Text": "เหลืออีกประมาณ {0} นาที"
                    },
                    "Key": "StatusEtaFmt"
                },
                {
                    "Source": {
                        "Text": "→ for {0}"
                    },
                    "Translation": {
                        "Text": "→ สำหรับ {0}"
                    },
                    "Key": "PlanItemForFmt"
                },
                {
                    "Source": {
                        "Text": "→ makes {0} buildable"
                    },
                    "Translation": {
                        "Text": "→ ทำให้สร้าง {0} ได้"
                    },
                    "Key": "PlanUnlockMakesFmt"
                },
                {
                    "Source": {
                        "Text": "▼"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceExpandChevron"
                }
            ]
        }
    ]
}